{"title":"28 L Insulated Soft Backpack Cooler Lightweight Bag for Men Women Ideal for Camping Hiking Picnics Day Trips","id":"28-l-insulated-soft-backpack-cooler-lightweight-bag-for-men-women-ideal-for-camping-hiking-picnics-day-trips","brand":"Indago8","ASIN":"B07DYHLFPQ","price":"25.99","regularPrice":"25.99","description":"<p>\n        \n\n\n\n\n\n  \n    \n  \n\n\n        \n        \n     \n\t       \n     \n\n     \n                              \n     \n       \t       \n        \n        <!-- show up to 2 reviews by default --> \n        \n        \t\n        \t\n        \t\t\n        \t\t\t</p><p>Designed for recreation. Whether its day trips to the park, camping, picnics, hiking, walking, fishing, festivals, beach or road trips, sports events (or virtually any other outdoor activity you can think of!), this stylish INESOI backpack cooler will keep your food and beverages cool all day long. Light when empty, this bag is also ideal for your daily commute to work or your vacation as it will fold down neatly to fit in your luggage. Also perfect as a present / gift. Whatever the occasion this is one backpack cooler you wont be embarrassed to carry on your shoulders. </p><p> <b>Material &amp; Features</b><br> Made from durable 600D polyester in stylish two-tone gray with a black trim, it features adjustable, padded shoulder straps with an elasticated chest strap to give you the most comfortable, secure fit, so whatever you&apos;re carrying you can do it hands free, no hassle. There is a convenient grab handle on the top and the front pocket has a handy mesh pouch for picnic cutlery or your phone and keys. Dual mesh side pockets act as quick storage for extra bottles, while the front bungee cord is perfect for your picnic blanket or extra layers. </p><p> <b>Use &amp; Performance</b><br> This 28 L cooler (17.7 x 13 x 7.4 in) has a thick layer of insulated foam between the polyester outer layer and the PEVA inner lining of the main compartment that works to keep your stuff cold all day long. The outer material is also water repellent to help keep your kit dry. Please note, we don&apos;t recommend that you put ice directly in the backpack, as it has stitched seams and is not leakproof. Instead, to give you the best performance (&amp; to keep you dry!) we recommend the use of flexible reusable ice packs. <b>Tip:</b> If you only have a single ice pack, place it near the top of the bag as cool air sinks. </p><p> <b>Take advantage of our special launch price ($25.99 down from $40) before this offer ends!</b><br></p><p><b>Peace of Mind</b><br> If you don&apos;t love it, return it within 30 days for a full refund!\n\t\t\t\t    \t\n\t\t\t\t\t</p>\n        \t\t\n        \t\t\n        \t\n        \n                \n        \n        \n      \n      \n    \n    <p></p>","features":["Make sure this fits\n                by entering your model number.","LAUNCH PRICE! $25.99 DOWN FROM $40. Take advantage of our special launch offer before it ends!","KEEP YOUR FOOD & BEVERAGES COOLER FOR LONGER. The insulated main compartment maintains a cooler temperature for longer so you don’t have to take lunch early or down your beers too quickly on your day trips.","FEEL COMFORTABLE, EVEN WHEN FULLY LOADED. Adjustable, padded shoulder straps combine with an adjustable chest strap and a fully padded back to help to make carrying this backpack a comfortable experience.","A COOL BAG WITHOUT THE COOL BAG LOOKS. Whether its for picnics, hiking, fishing, festivals, beach or road trips, sports events or simply to commute to work, its clean, stylish design means this bag will look good on any occasion.","ROOM FOR FAMILY & FRIENDS! With a large main compartment that's got enough storage space to hold 30 cans of beer (or your preferred beverage!) & still have room for a couple of ice packs, this bag is spacious without being cumbersome. A zippered front pocket, two mesh side pockets, and a front bungee cord allow you to carry your other essential belongings with ease."],"sku":{"label":"Color","options":[{"name":"Default","code":"B07DYHLFPQ","url":"https://www.amazon.com/Insulated-Soft-Backpack-Cooler-Lightweight/dp/B07DYHLFPQ/ref=sr_1_1_sspa?ie=UTF8","images":[{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/91WVuJ5dRNL._SL1500_.jpg","localFileName":"default-0.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/813fS%2BtoD4L._SL1500_.jpg","localFileName":"default-1.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/91KTOKCyguL._SL1500_.jpg","localFileName":"default-2.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81n3ysyzwFL._SL1500_.jpg","localFileName":"default-3.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81a1-b7d3FL._SL1500_.jpg","localFileName":"default-4.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81SfpHnjdcL._SL1500_.jpg","localFileName":"default-5.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/91Dvxc2047L._SL1500_.jpg","localFileName":"default-6.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/A1DmiKgqLuL._SL1500_.jpg","localFileName":"default-7.jpeg"}]}]},"attributes":{"Provider":"https://www.amazon.com/Insulated-Soft-Backpack-Cooler-Lightweight/dp/B07DYHLFPQ/ref=sr_1_1_sspa?ie=UTF8","Color":["Default"],"Dimensions":{"length":"18.8","width":"33.0","height":"45.0"},"Weight":"585g","Shipping Weight":"585g"}}