{"title":"50 Can Soft Sided Collapsible Cooler 8 Gal 30 L Insulated Cooler Tote Bag with Pockets and Adjustable Shoulder Strap Grayblack","id":"50-can-soft-sided-collapsible-cooler-8-gal-30-l-insulated-cooler-tote-bag-with-pockets-and-adjustable-shoulder-strap-grayblack","brand":"Eltrek","ASIN":"","price":"29.99","regularPrice":"29.99","description":"<p>\n        \n\n\n\n\n\n  \n    \n  \n\n\n        \n        \n     \n\t       \n     \n\n     \n                              \n     \n       \t       \n        \n        <!-- show up to 2 reviews by default --> \n        \n        \t\n        \t\n        \t\t\n        \t\t\t</p><p>Whether you are traveling, camping, picnicking or grocery shopping, the INESOI cooler bag can keep your food and drinks cool/warm for hours! It&apos;s fully insulated and large enough to hold 50 cans plus ice. This versatile cooler comes with front and side pockets, soft handle, shoulder strap and a built-in bottle opener. It&#x2019;s made with durable materials and can be folded for easy storage. Wherever you go, this is the perfect cooler for your everyday use.<br><br><b>KEY FEATURES</b><br><br> <b>Large capacity </b><br> Holds 50 cans plus ice<br> <br> <b>Space Saver</b><br> Easy to store by simply folding it down flat when not in use.<br> <br> <b>Keep cool or warm longer</b><br> Insulated on all sides with 8mm EPE foam.<br> <br> <b>Leak-proof</b><br> Prevent leaks with heat-sealed thick PEVA liner.<br> <br> <b>Portable</b><br> Lightweight and easy to carry with padded handle and shoulder strap.<br> <br> <b>Built-in bottle opener</b><br> Convenient and always ready for any adventure.<br> <br> <b>SPECIFICATION</b><br><br><b>Capacity:</b> 50-can/30 L/8 Gal<br> <b>Material: </b><br> Exterior: 900D Oxford fabric<br> Insulation: 8mm EPE foam<br> Interior: PEVA liner<br> <b>Size:</b> 17.71x11.81x12.59 in (45x30x32cm)<br> <b>Weight:</b> 2.16 lbs (0.98 kg) <br><b>Adjustable shoulder strap length:</b> 32&#x201D; - 53&#x201D; <br><b>\t\t\t\t    \t\n\t\t\t\t\t</b></p>\n        \t\t\n        \t\t\n        \t\n        \n                \n        \n        \n      \n      \n    \n    <p></p>","features":["Make sure this fits\n                by entering your model number.","LARGE CAPACITY: The  cooler dimensions are 17.71 x 11.81 x 12.59 in (45 x 30 x 32cm), large enough to hold 50 beverage cans plus ice. It’s also great for storing food and snacks, ideal for picnicking, camping, beach, BBQ, or keeping your groceries cool/warm. This versatile cooler comes with three pockets, so it’s perfect for storing additional items for your adventures, such as utensils, napkins, sunscreen or phone.","EFFECTIVE INSULATION DESIGN: This cooler bag is constructed with three layers of high-quality materials. The exterior is made of durable 900D Oxford fabric. It's insulated on all sides with a thick 8mm EPE foam. The interior is made of thick PEVA liner. What all this means is that the  cooler will keep your food and drinks cold/warm for hours.","LEAK-PROOF INTERIOR: Our cooler interior is constructed with heat-sealed thick PEVA liner that prevents leaks. So you can put ice directly in the bag to keep your food and drinks cold without worrying about water leakage. It’s also easy to clean. Simply wipe it with a damp towel using mild soap and water and let it air dry.","COMPACT & DURABLE: When you are done with the cooler for the day, you can easily fold it down flat and store it just about anywhere. Ideal for travel or if you have limited storage space. This collapsible cooler also comes with upgraded strong double top zippers for maximum durability. That makes it easy for you to open and close the cooler whenever you need it.","PORTABLE & CONVENIENT: Always be ready for any adventure with this portable cooler. It is lightweight and easy to carry with a soft top handle and an adjustable shoulder strap. It also comes with a built-in bottle opener to assist with your beverages. So there is one less thing for you to have to think about when you are on the go."],"sku":{"label":"Color","options":[{"name":"Default","code":"","url":"https://www.amazon.com/Eltrek-Collapsible-Insulated-Adjustable-Shoulder/dp/B07CT2Q1GM/ref=sr_1_2_sspa?ie=UTF8","images":[{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81tG2buAyZL._SL1500_.jpg","localFileName":"default-0.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81Vac-wJepL._SL1500_.jpg","localFileName":"default-1.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81F0CJeD7cL._SL1500_.jpg","localFileName":"default-2.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/811LhEbL4EL._SL1500_.jpg","localFileName":"default-3.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/71r62DEkWOL._SL1500_.jpg","localFileName":"default-4.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81SjwLK6STL._SL1500_.jpg","localFileName":"default-5.jpeg"}]}]},"attributes":{"Provider":"https://www.amazon.com/Eltrek-Collapsible-Insulated-Adjustable-Shoulder/dp/B07CT2Q1GM/ref=sr_1_2_sspa?ie=UTF8","Color":["Default"],"Dimensions":{"length":"45.7","width":"30.5","height":"30.5"},"Shipping Weight":"998g"}}