{"title":"Travel Wallet Family Passport Holder Rfid Blocking Document Holder Organizer Protects Your Passports Grey","id":"travel-wallet-family-passport-holder-rfid-blocking-document-holder-organizer-protects-your-passports","brand":"Raytix","ASIN":"B079H4TT1S","price":"17.99","regularPrice":"17.99","description":"<p>\n        \n\n\n\n\n\n  \n    \n       \n        \n          \n        <div class="\"disclaim\"">\n          \n            \n            \n            \n                         \n          \n          </div>\n        \n      \n    \n  \n\n\n        \n        \n     \n\t       \n     \n\n     \n                              \n     \n       \t       \n        \n        <!-- show up to 2 reviews by default --> \n        \n        \t\n        \t\n        \t\t\n        \t\t\t</p><p></p><p><b>Keep All of Your Family&apos;s Important Documents In A Single, Safe Place - Starting Today!</b></p><p>Are you looking for a smart and secure way to organize your family&apos;s passports, travel papers, and other important documents?</p><p>Don&apos;t you hate the idea of having to waste tons of money on multiple RFID-blocking wallets and document holders, just to keep your loved ones safe from electronic scam attempts?</p><p>If that&apos;s the case, this amazing family travel wallet is exactly what you need!</p><p><b>Ratix Premium Travel Wallet &amp; Family Passport Case - Your Family&apos;s Go-To Traveling Assistant!</b></p><p>Keeping your family&apos;s identification and travel documents organized, safe, and secure has never been this easy!</p><p>Large enough to hold passports, money, credit cards, and identification documents for up to 6 people, this family travel passport case and document organizer is a must for every family trip.</p><p>Moreover, its lightweight materials and compact design make it truly easy to carry, as it can easily fit in any travel bag, suitcase, or backpack!</p><p><b>Specially Designed To Prevent Electronic Theft Attempts</b></p><p>While traveling abroad, you should bear in mind that unauthorized, undetectable card scans can compromise the personal information of you and your family members.</p><p>That&apos;s why it&apos;s wise to keep your passports, credit cards, and other documents in an RFID-blocking travel wallet, case, or accessory.</p><p>With RFID-shielding lining woven in the very fabric of its covers, this travel document is a smart and easy way to make sure your personal information remains secure!</p><p><b>So, What Are You Still Waiting For?</b></p><p><b>Order Your Own Ratix Premium Travel Wallet &amp; Family Passport Case Right Away!</b></p><p><b>Just Click &quot;Add To Cart&quot;!</b></p>\n\t\t\t\t    \t\n\t\t\t\t\t<p></p>\n        \t\t\n        \t\t\n        \t\n        \n                \n        \n        \n      \n      \n    \n    <p></p>","features":["Make sure this fits\n                by entering your model number.","DESIGNED FOR SAFE & HASSLE-FREE INTERNATIONAL TRAVEL - You can forget about having to hassle through multiple bags and wallets every time you need to use your passport, boarding pass, identification, or other personal document. Designed to organized everything in a safe and practical manner, this family passport case is a must have for every trip - especially when flying abroad!","ORGANIZE & KEEP ALL YOUR DOCUMENTS SAFE & IN ONE PLACE - Having your passports, identification, and travel documents organized in a secure and easy to access place is a must - especially when travelling abroad. That's exactly what this family travel wallet offers! With enough space and pockets for your money, up to 6 passports, tickets, 10+ cards, and travel documents, this safe document organizer case is your best traveling friend and companion!","AT LAST, A TRAVEL ACCESSORY YOU CAN ACTUALLY TRUST! - When it comes to our safe and secure travel wallets and family passport cases, we make a point of using nothing but the strongest, most durable lightweight nylon fabrics and other materials, as well as state of the art production processes and strict quality control.","PROTECT YOURSELF AGAINST ELECTRONIC IDENTITY THEFT - Equipped with specialized RFID blocking lining, this wonderful travel wallet will keep your passports, credit cards, and other personal documents safe from unauthorized card scanning and electronic identity theft attempts.","ORDER YOUR OWN TRAVEL WALLET NOW, WITH 0% RISK! - Your satisfaction and safety of your personal effects and documents is our number one priority. If your new travel document holder case proves to be not what you expected, just contact us and we'll do our best to put the smile back on your face, hassle-free!"],"sku":{"label":"Color","options":[{"name":"Black","code":"B079G427ZP","url":"https://www.amazon.com/Passport-Blocking-Document-Organizer-Passports/dp/B079G427ZP","images":[{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/71FQSHn-V6L._SL1250_.jpg","localFileName":"black-0.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81z3xBPparL._SL1250_.jpg","localFileName":"black-1.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81udn7BWi6L._SL1250_.jpg","localFileName":"black-2.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81QydFPIjML._SL1250_.jpg","localFileName":"black-3.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81sgugXT%2BsL._SL1250_.jpg","localFileName":"black-4.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/71RDScl3WxL._SL1250_.jpg","localFileName":"black-5.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/71G4fiNtHpL._SL1250_.jpg","localFileName":"black-6.jpeg"}]},{"name":"Grey","code":"B079H4TT1S","url":"https://www.amazon.com/Passport-Blocking-Document-Organizer-Passports/dp/B079H4TT1S","images":[{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81KqbPGNYTL._SL1250_.jpg","localFileName":"grey-0.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81rBjIsNy-L._SL1250_.jpg","localFileName":"grey-1.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/91o2szxDaiL._SL1250_.jpg","localFileName":"grey-2.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81UXeYovzOL._SL1250_.jpg","localFileName":"grey-3.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/81ytPBeZpWL._SL1250_.jpg","localFileName":"grey-4.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/71fvTdcNYoL._SL1250_.jpg","localFileName":"grey-5.jpeg"},{"originalSource":"https://images-na.ssl-images-amazon.com/images/I/71ZqyM0p0rL._SL1250_.jpg","localFileName":"grey-6.jpeg"}]}]},"attributes":{"Provider":"https://www.amazon.com/Passport-Blocking-Document-Organizer-Passports/dp/B079H4TT1S/ref=sr_1_2_sspa?s=apparel","Color":["Black","Grey"],"Weight":"119g","Shipping Weight":"119g"}}